#include<stdio.h>
int main(void)
{
    int a[10]={1,5,9,12,14,35,36,75,83,96};					//默认数组中的的有序元素 
    int l,m,r,n;
    printf("请输入其中的一个数\n可以是:1,5,9,12,14,35,36,75,83,96\n");
    scanf("%d",&n);
    l = 0, r = 9;											//设定最左右端的位置 
    while(l <= r)
    {
      	m = (l+r)/2;										//用m记录当前左右端点的中点位置 
      	if(n == a[m])
        {
    		    printf("%d所在的位置是%d\n",n,m+1);
            break;											//如果正好在m处查找到数，则输出下标+1，表示位置 
        } 
      	else 
        {
            if(n > a[m])
             		l = m+1;									//如果当前输入的数大于中点，则左端右移 
   	        else
              	r = m-1;									//如果小于的话，就右端左移 
        } 
      }
  	return 0; 
}
