/*
有一个长度为n(n<=100)的数列，该数列定义为从2开始的递增有序
偶数，现在要求你按照顺序每m个数求出一个平均值，如果最后不
足m个，则以实际数量求平均值。编程输出该平均值序列。              
输入描述
每组输入数据占一行，包含两个正整数n和m，n和m的含义如上所述。              
输出描述
对于每组输入数据，输出一个平均值序列，每组输出占一行。              
样例输入
4 2                
样例输出
3 7      
*/
#include <stdio.h>

int main()
{
	int i;
	int j = 2;
	int m,n;
	int k;
	int s = 0;
	int s1 = 0;
	scanf("%d%d",&n,&m);
	k = n%m;
	for(i = 1; i <= n - k; i++,j += 2)
	{
		s += j;
		if(i%m == 0)
		{
			printf("%d ",s/m);
			s = 0;
		}
	}
	if(k != 0)
	{
		for(i = n - k + 1; i <= n; i++,j +=2)
		{
			s1 += j;
		}
		printf("%d",s1/k);
	}
	return 0;
}
