#include <stdio.h>
#define N 30
int main()
{
	int a[N + 1][N + 1],i,j,k,p,m,n;
 	p = 1;
 	while(p == 1)
   	{
    	printf("input n\n"); 
     	scanf("%d",&n);             //魔方阵的阶数只能为基数阶
     	if((n != 0) && (n <= N) && (n%2 != 0));//限制n的范围
     	p=0;
   	}

	for(i = 1; i <= n; i++)
	{
		for(j = 1; j <= n; j++)
		{
			a[i][j] = 0; 			//默认数组中的每个元素为0
		}          	
	}
	
	j = n/2 + 1;
	a[1][j] = 1;  					//找到第一行的中间位置，并赋值为1
	                      
 	for(k = 2; k <= n*n; k++)       //k值从2到n平方
   	{
     	i = i-1;					//行减1 
     	j = j+1;  					//列加1，跳到下一个位置 
		                       
    	if((i < 1) && (j > n))      //如果当前位置为右上极点值 
       	{                           
         	i = i+2;				//向下跳两行 
         	j = j-1;                //向左回一行 
       	}                           //即原位置下边 
     	else                        //如果不满足30行的条件 
       	{
         if(i < 1)					//如i在第一行 
           i = n;					//则直接跳到n行
         if(j > n)					//如果j在最右一列 
           j = 1;					//则直接跳到第一列 
       	}
     	if(a[i][j] == 0)			//如果这个新到的位置没有被填充数字的话 
        	a[i][j] = k;			//就将k的值给它 
     	else						//如果这儿已经填充元素 
       	{
          i = i+2;					//行到下一行 
          j = j-1;					//列复原 
          a[i][j] = k;				//赋值k 
       	}
    }
  	   	  						   	//输出排好的魔方阵
	for(i = 1; i <= n; i++)
	{
    	for(j = 1; j <= n; j++)
    	{
    		printf("%3d ",a[i][j]);
    	}
      	printf("\n");
   	}
   	return 0;
} 
