/*
	用于处理学生的成绩，
	能计算每个人的总分
	每科的平均分，并以
	表格形式输出 
*/
#include<stdio.h>
int main()
{
	float a[4][6] = {0};							//横纵坐标分别多1，用于储存每个学生的总分和每科平均分 
	int  i,j;
	float ave[3];
	float sub_ave[5];
	printf("请输入3个学生的5门成绩\n\n"); 
	for(i = 0; i < 3; i++)
	{
		printf("现在是第%d名学生\n",i + 1);
		for(j = 0; j < 5; j++)
		{
			printf("     课程%d的成绩",j + 1);
			scanf("%f",&a[i][j]);					//接收每个学的每科分数 
			a[i][5] += a[i][j];						//计算总分，并存储行末元素 
		} 
		printf("\n");
	}
	
	printf("原数据:\n");
	printf("---------------------------------\n"); 
	for(i = 0; i < 3; i++)
	{
		for(j = 0; j < 5; j++)
		{
			printf("%-7.2f",a[i][j]);
		}
		printf("\n");							
	}
	printf("---------------------------------\n");	//输出输入的数据 
												
	for(j = 0; j < 5; j++)
	{
		for(i = 0; i < 3; i++)
		{
			a[3][j] += a[i][j];
		}
	}												//计算没课总分，存储在列末元素 
	
	printf("\n处理后的结果\n");
	printf("----------------------------------------------------\n"); 
	printf("课程号:\t");
	for(j = 1; j <= 5; j++)
	{
		printf("%d\t",j);							//输入课程及其编号 
	} 
	printf("总分"); 
	printf("\n----------------------------------------------------");
	printf("\n"); 
	for(i = 0; i < 3; i++)
	{
		printf("学生 %d:\t",i+1);
		for(j = 0;j <= 5; j++)
		{
			printf("%-.2f\t",a[i][j]);				//输出学生的每科成绩 
		}
		printf("\n");
	}
	printf("----------------------------------------------------\n");
	printf("总 分 :\t");
	for(j = 0; j < 5; j++)
	{
		printf("%-.2f\t",a[3][j]); 					//输入每个人的总分 
	}
	
	printf("\n\n");
	printf("平均分:\t");
	for(j = 0; j < 5; j++)
	{
		printf("%-.2f\t",a[3][j]/3); 				//输出每科平均分 
	}	
	printf("\n----------------------------------------------------\n"); 
	return 0;
}
