#include<stdio.h>
int main()
{   
	int max;
	int index = 0;
	int i,a,t[10] = {0};		//定义一个数组储存没每个数出现的次数 
	printf("请输入10个0-9的数：\n"); 
	for(i = 0; i < 10; i++)		//假设只处理10个数，可以将10改为任何数字 
	{
		scanf("%d",&a);			//接收一个数（限 0-9 ） 
		if(a == 0) 
		{
			t[0] += 1;
		}
		if(a == 1) 
		{
			t[1] += 1;			//判断输入的数a是多少，如果是1则下标为1的数组元素自加1，每个元素都如此 
		}
		if(a == 2) 
		{
			t[2] += 1;
		}
		if(a == 3) 
		{
			t[3] += 1;
		}
		if(a == 4) 
		{
			t[4] += 1;
		}
		if(a == 5) 
		{
			t[5] += 1;
		}
		if(a == 6) 
		{
			t[6] += 1;
		}
		if(a == 7) 
		{
			t[7] += 1;
		}
		if(a == 8) 
		{
			t[8] += 1;
		}
		if(a == 9) 
		{
			t[9] += 1;
		}
	}
	max = t[0];
	for(i = 0; i < 10; i++)		
   	{ 
		if(t[i] > max) 			//使用循环判断哪个数的次数出现最多 
		{
			max = t[i];
			index = i;			//用index记录下标，计输入的数 
		}		
	}
    printf("出现次数最多的是%d\n次数是%d",index,max);   //输入这个数和其出现的次数 
    return 0; 
}
